### Завдання (творче): Go routines, channels

#### Основні Цілі
Це завдання призначене для того, щоб ви могли практично застосувати концепції каналів, ГО-рутин, сінхронізації

#### Завдання
Створіть ігру у хрестики-ноліки, де 2 горутини будуть гравцями, передаючі ход одна одній.
Кожен ход поле гри повинно оновлюватися. Для очистки екрану можно використати код:
```go
println("\x1B[2J\x1B[H")
```
Після хода робити паузу в 1секунду.
```go
time.Sleep(time.Second)
```

**Тестування**
Запустити, переконатись, що один з гравців має перемогу.

#### Розширення
Якщо ви хочете додатково поглибити розуміння, спробуйте наступне:
Зробіть параметрезуємі :
- Розмір поля гри
- Правила (кількість в ряд)

Для параметрізації можна використати пакет flags:
```
package main

import "flag"

var (
	fieldSize = flag.Int("size", 3, "field size")
	rule      = flag.Int("rule", 3, "game rule (cont of cells in line to win)")
)

func main() {
	flag.Parse()
	println("Hello, world!")
	println("\x1B[2J\x1B[H")
	println("Field size:", *fieldSize)
	println("Rule:", *rule)
}
```


#### Критерії Оцінювання
- Чи отримує перемогу один з гравців ?
- Чи чіткий і зрозумілий код та коментарі?
